# 3. Написать функцию, аргументы имена сотрудников, возвращает словарь, ключи — первые буквы имён, значения — списки,
# содержащие имена, начинающиеся с соответствующей буквы.
# in
# "Иван", "Мария", "Петр", "Илья", "Марина", "Петр", "Алина", "Бибочка"
# out
# {'А': ['Алина'], 'Б': ['Бибочка'], 'И': ['Иван', 'Илья'], 'М': ['Марина', 'Мария'], 'П': ['Петр', 'Петр']}

def dict_of_names(*name):
    name_dict = {}
    for i in sorted(name):
        f_letter = i[0]
        if f_letter not in name_dict:
            name_dict[f_letter] = [i]
        name_dict[f_letter] += [i]
    return name_dict


print(dict_of_names("Иван", "Мария", "Петр", "Илья", "Марина", "Петр", "Алина", "Бибочка"))

